armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G0xx/Keil.STM32G0xx_DFP.pdsc
        <!-- *************************  Device 'STM32G041F6Px'  ***************************** -->
        <device Dname="STM32G041F6Px">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32G041G6Ux'  ***************************** -->
        <device Dname="STM32G041G6Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G041J6Mx'  ***************************** -->
        <device Dname="STM32G041J6Mx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="SOP" n="8" name="SO8N"/>
        </device>

        <!-- *************************  Device 'STM32G041K6Tx'  ***************************** -->
        <device Dname="STM32G041K6Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G041K6Ux'  ***************************** -->
        <device Dname="STM32G041K6Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- ################################### 64 KB ################################## -->
        <!-- *************************  Device 'STM32G041C8Tx'  ***************************** -->
        <device Dname="STM32G041C8Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G041C8Ux'  ***************************** -->
        <device Dname="STM32G041C8Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G041F8Px'  ***************************** -->
        <device Dname="STM32G041F8Px">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32G041G8Ux'  ***************************** -->
        <device Dname="STM32G041G8Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G041K8Tx'  ***************************** -->
        <device Dname="STM32G041K8Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G041K8Ux'  ***************************** -->
        <device Dname="STM32G041K8Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G041Y8Yx'  ***************************** -->
        <device Dname="STM32G041Y8Yx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00002000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="CSP" n="18"/>
        </device>

      </subFamily>

