armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G0xx/Keil.STM32G0xx_DFP.pdsc
      <!-- ************************  Subfamily 'STM32G070'  **************************** -->
      <subFamily DsubFamily="STM32G070">
        <debug svd="CMSIS/SVD/STM32G070.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xx.h" define="STM32G070xx"/>
        <book name="Documentation/DM00463896.pdf" title="STM32G0x0 Reference Manual"/>
        <book name="Documentation/DM00542744.pdf" title="STM32G070CB/KB/RB Data Sheet"/>

        <debugvars configfile="CMSIS/Debug/STM32G0x0.dbgconf" version="1.0.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00000000;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00000000;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32G0xx_OTP.FLM"    start="0x1FFF7000" size="0x00000400" default="0"/>
        <algorithm name="CMSIS/Flash/STM32G0x0_OPT.FLM"    start="0x1FFF7800" size="0x0000000C" default="0"/>

        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32G070CBTx'  ***************************** -->
        <device Dname="STM32G070CBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G070KBTx'  ***************************** -->
        <device Dname="STM32G070KBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G070RBTx'  ***************************** -->
        <device Dname="STM32G070RBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="64"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'STM32G071'  **************************** -->
      <subFamily DsubFamily="STM32G071">
        <debug svd="CMSIS/SVD/STM32G071.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xx.h" define="STM32G071xx"/>
        <book name="Documentation/DM00371828.pdf" title="STM32G0x1 Reference Manual"/>
        <book name="Documentation/DM00412180.pdf" title="STM32G071x8/xB Data Sheet"/>

        <debugvars configfile="CMSIS/Debug/STM32G0x1.dbgconf" version="1.0.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00000000;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00000000;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32G0xx_OTP.FLM"    start="0x1FFF7000" size="0x00000400" default="0"/>
        <algorithm name="CMSIS/Flash/STM32G0x1_OPT.FLM"    start="0x1FFF7800" size="0x00000020" default="0"/>

        <!-- ################################### 32 KB ################################## -->
        <!-- *************************  Device 'STM32G071C6Tx'  ***************************** -->
        <device Dname="STM32G071C6Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G071C6Ux'  ***************************** -->
        <device Dname="STM32G071C6Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G071G6Ux'  ***************************** -->
        <device Dname="STM32G071G6Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G071K6Tx'  ***************************** -->
        <device Dname="STM32G071K6Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071K6Ux'  ***************************** -->
        <device Dname="STM32G071K6Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071R6Tx'  ***************************** -->
        <device Dname="STM32G071R6Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00008000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_32.FLM"    start="0x08000000" size="0x00008000" default="1"/>

          <feature type="QFP" n="64"/>
        </device>

        <!-- ################################### 64 KB ################################## -->
        <!-- *************************  Device 'STM32G071C8Tx'  ***************************** -->
        <device Dname="STM32G071C8Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G071C8Ux'  ***************************** -->
        <device Dname="STM32G071C8Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G071G8Ux'  ***************************** -->
        <device Dname="STM32G071G8Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G071G8UxN'  **************************** -->
        <device Dname="STM32G071G8UxN">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G071K8Tx'  ***************************** -->
        <device Dname="STM32G071K8Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071K8TxN'  **************************** -->
        <device Dname="STM32G071K8TxN">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071K8Ux'  ***************************** -->
        <device Dname="STM32G071K8Ux">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071K8UxN'  **************************** -->
        <device Dname="STM32G071K8UxN">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G071R8Tx'  ***************************** -->
        <device Dname="STM32G071R8Tx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00010000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_64.FLM"    start="0x08000000" size="0x00010000" default="1"/>

          <feature type="QFP" n="64"/>
        </device>

