armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G0xx/Keil.STM32G0xx_DFP.pdsc
      <!-- ************************  Subfamily 'STM32G081'  **************************** -->
      <subFamily DsubFamily="STM32G081">
        <debug svd="CMSIS/SVD/STM32G081.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xx.h" define="STM32G081xx"/>
        <book name="Documentation/DM00371828.pdf" title="STM32G0x1 Reference Manual"/>
        <book name="Documentation/DM00412176.pdf" title="STM32G081xB Data Sheet"/>

        <debugvars configfile="CMSIS/Debug/STM32G0x1.dbgconf" version="1.0.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00000000;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00000000;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32G0xx_OTP.FLM"    start="0x1FFF7000" size="0x00000400" default="0"/>
        <algorithm name="CMSIS/Flash/STM32G0x1_OPT.FLM"    start="0x1FFF7800" size="0x00000020" default="0"/>

        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32G081CBTx'  ***************************** -->
        <device Dname="STM32G081CBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G081CBUx'  ***************************** -->
        <device Dname="STM32G081CBUx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32G081EBYx'  ***************************** -->
        <device Dname="STM32G081EBYx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="CSP" n="25"/>
        </device>

        <!-- *************************  Device 'STM32G081GBUx'  ***************************** -->
        <device Dname="STM32G081GBUx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G081GBUxN'  **************************** -->
        <device Dname="STM32G081GBUxN">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32G081KBTx'  ***************************** -->
        <device Dname="STM32G081KBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G081KBTxN'  **************************** -->
        <device Dname="STM32G081KBTxN">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G081KBUx'  ***************************** -->
        <device Dname="STM32G081KBUx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G081KBUxN'  **************************** -->
        <device Dname="STM32G081KBUxN">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32G081RBIx'  ***************************** -->
        <device Dname="STM32G081RBIx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>

          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32G081RBTx'  ***************************** -->
        <device Dname="STM32G081RBTx">
          <memory name="Main_Flash" access="rx"  id="IROM1" start="0x08000000" size="0x00020000" default="1" startup="1"/>
          <memory name="SRAM"       access="rwx" id="IRAM1" start="0x20000000" size="0x00009000" default="1" init="0"/>

          <algorithm name="CMSIS/Flash/STM32G0xx_128.FLM"   start="0x08000000" size="0x00020000" default="1"/>
          <feature type="QFP" n="64"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32G0">
      <description>STMicroelectronics STM32G0 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G0*"/>
    </condition>

    <condition id="STM32G030">
      <description>STMicroelectronics STM32G030 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G030*"/>
    </condition>
    <condition id="STM32G031">
      <description>STMicroelectronics STM32G031 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G031*"/>
    </condition>
    <condition id="STM32G041">
      <description>STMicroelectronics STM32G041 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G041*"/>
    </condition>
    <condition id="STM32G070">
      <description>STMicroelectronics STM32G070 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G070*"/>
    </condition>
    <condition id="STM32G071">
      <description>STMicroelectronics STM32G071 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G071*"/>
    </condition>
    <condition id="STM32G081">
      <description>STMicroelectronics STM32G081 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G081*"/>
    </condition>

