armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G0xx/Keil.STM32G0xx_DFP.pdsc
    <!-- Device + Compiler Conditions (ARMCC) -->
    <condition id="STM32G030 ARMCC" >
      <description>STMicroelectronics STM32G030 Devices and ARMCC Compiler</description>
      <require condition="STM32G030"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32G031 ARMCC" >
      <description>STMicroelectronics STM32G031 Devices and ARMCC Compiler</description>
      <require condition="STM32G031"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32G041 ARMCC" >
      <description>STMicroelectronics STM32G041 Devices and ARMCC Compiler</description>
      <require condition="STM32G041"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32G070 ARMCC" >
      <description>STMicroelectronics STM32G070 Devices and ARMCC Compiler</description>
      <require condition="STM32G070"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32G071 ARMCC" >
      <description>STMicroelectronics STM32G071 Devices and ARMCC Compiler</description>
      <require condition="STM32G071"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32G081 ARMCC" >
      <description>STMicroelectronics STM32G081 Devices and ARMCC Compiler</description>
      <require condition="STM32G081"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32G0x0 ARMCC" >
      <description>STMicroelectronics STM32G0x0 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G0?0*"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32G0x1 ARMCC" >
      <description>STMicroelectronics STM32G0x1 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32G0?1*"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32G0xx ARMCC" >
      <description>STMicroelectronics STM32G0xx Devices and ARMCC Compiler</description>
      <require condition="STM32G0"/>
      <require condition="Compiler ARMCC"/>
    </condition>


    <!-- Device + Compiler Conditions (GCC) -->
    <condition id="STM32G030 GCC" >
      <description>STMicroelectronics STM32G030 Devices and GCC Compiler</description>
      <require condition="STM32G030"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32G031 GCC" >
      <description>STMicroelectronics STM32G031 Devices and GCC Compiler</description>
      <require condition="STM32G031"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32G041 GCC" >
      <description>STMicroelectronics STM32G041 Devices and GCC Compiler</description>
      <require condition="STM32G041"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32G070 GCC" >
      <description>STMicroelectronics STM32G070 Devices and GCC Compiler</description>
      <require condition="STM32G070"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32G071 GCC" >
      <description>STMicroelectronics STM32G071 Devices and GCC Compiler</description>
      <require condition="STM32G071"/>
      <require condition="Compiler GCC"/>
    </condition>
    <condition id="STM32G081 GCC" >
      <description>STMicroelectronics STM32G081 Devices and GCC Compiler</description>
      <require condition="STM32G081"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- Device + Compiler Conditions (IAR) -->
    <condition id="STM32G030 IAR" >
      <description>STMicroelectronics STM32G030 Devices and IAR Compiler</description>
      <require condition="STM32G030"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32G031 IAR" >
      <description>STMicroelectronics STM32G031 Devices and IAR Compiler</description>
      <require condition="STM32G031"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32G041 IAR" >
      <description>STMicroelectronics STM32G041 Devices and IAR Compiler</description>
      <require condition="STM32G041"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32G070 IAR" >
      <description>STMicroelectronics STM32G070 Devices and IAR Compiler</description>
      <require condition="STM32G070"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32G071 IAR" >
      <description>STMicroelectronics STM32G071 Devices and IAR Compiler</description>
      <require condition="STM32G071"/>
      <require condition="Compiler IAR"/>
    </condition>
    <condition id="STM32G081 IAR" >
      <description>STMicroelectronics STM32G081 Devices and IAR Compiler</description>
      <require condition="STM32G081"/>
      <require condition="Compiler IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32G0 CMSIS">
      <description>STMicroelectronics STM32G0 Device and CMSIS-CORE</description>
      <require condition="STM32G0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- HAL Conditions -->
    <condition id="STM32G0 HAL">
      <description>STMicroelectronics STM32G0 Device and HAL</description>
      <require condition="STM32G0"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32G0 HAL Common">
      <description>STMicroelectronics STM32G0 Device and HAL Common</description>
      <require condition="STM32G0"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>
    <condition id="STM32G0 HAL DMA">
      <description>STMicroelectronics STM32G0 Device and HAL with DMA</description>
      <require condition="STM32G0"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32G0 HAL GPIO">
      <description>STMicroelectronics STM32G0 Device and HAL with GPIO</description>
      <require condition="STM32G0"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>

    <!-- LL driver Conditions -->
    <condition id="STM32G0 LL">
      <description>STMicroelectronics STM32G0 Device and LL</description>
      <require condition="STM32G0"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="Common"/>
    </condition>
    <condition id="STM32G0 LL Common">
      <description>STMicroelectronics STM32G0 Device and LL</description>
      <require condition="STM32G0"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>

