armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32G0xx/Keil.STM32G0xx_DFP.pdsc
  </conditions>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command> <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir> <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" exclusive="1" Capiversion="1.1.0">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.3.0" condition="STM32G0 CMSIS">
      <description>System Startup for STMicroelectronics STM32G0 Series</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STARTUP_STM32G0XX    /* Device Startup for STM32G0 */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32G0xx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" condition="STM32G0x0 ARMCC" name="MDK/Device/Source/ARM/STM32G0x0_OPT.s" attr="template" select="Flash Option Bytes"/>
        <file category="source" condition="STM32G0x1 ARMCC" name="MDK/Device/Source/ARM/STM32G0x1_OPT.s" attr="template" select="Flash Option Bytes"/>
<!--    <file category="source" condition="STM32G0xx ARMCC" name="MDK/Device/Source/ARM/STM32G0xx_OTP.s" attr="template" select="Flash One-Time programmable Bytes"/> -->

        <!-- common device header file -->
        <file category="header" name="Drivers/CMSIS/Device/ST/STM32G0xx/Include/stm32g0xx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source" condition="STM32G030 ARMCC" name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/arm/startup_stm32g030xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G031 ARMCC" name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/arm/startup_stm32g031xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G041 ARMCC" name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/arm/startup_stm32g041xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G070 ARMCC" name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/arm/startup_stm32g070xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G071 ARMCC" name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/arm/startup_stm32g071xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G081 ARMCC" name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/arm/startup_stm32g081xx.s" attr="config" version="1.3.0"/>

        <!-- GCC Toolchain -->
        <file category="source" condition="STM32G030 GCC"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/gcc/startup_stm32g030xx.S" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G031 GCC"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/gcc/startup_stm32g031xx.S" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G041 GCC"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/gcc/startup_stm32g041xx.S" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G070 GCC"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/gcc/startup_stm32g070xx.S" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G071 GCC"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/gcc/startup_stm32g071xx.S" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G081 GCC"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/gcc/startup_stm32g081xx.S" attr="config" version="1.3.0"/>

        <!-- IAR Toolchain -->
        <file category="source" condition="STM32G030 IAR"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/iar/startup_stm32g030xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G031 IAR"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/iar/startup_stm32g031xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G041 IAR"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/iar/startup_stm32g041xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G070 IAR"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/iar/startup_stm32g070xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G071 IAR"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/iar/startup_stm32g071xx.s" attr="config" version="1.3.0"/>
        <file category="source" condition="STM32G081 IAR"   name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/iar/startup_stm32g081xx.s" attr="config" version="1.3.0"/>

        <!-- system file -->
        <file category="source"                             name="Drivers/CMSIS/Device/ST/STM32G0xx/Source/Templates/system_stm32g0xx.c"        attr="config" version="1.3.0"/>
      </files>
    </component>

    <component generator="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" Capiversion="1.0.0" condition="STM32G0">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
        <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl" version ="1.0.0"/>
      </files>
    </component>

